app/Controllers/Pedidos.php

    public function confirmarEntrega($id)
    {
        $pedido = $this->pedidoModel->find($id);

        if (!$pedido || $pedido['usuario_id'] != session('usuario_id')) {
            return redirect()->back()->with('error', 'Pedido não encontrado');
        }

        if ($pedido['status'] != 'enviado') {
            return redirect()->back()->with('error', 'Este pedido não está marcado como enviado');
        }

        $data = [
            'data_entrega' => date('Y-m-d H:i:s'),
            'status' => 'entregue',
        ];

        if ($this->pedidoModel->update($id, $data)) {
---
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '14'
UPDATE `pedidos` SET `data_entrega` = '2025-06-15 12:48:49', `status` = 'entregue', `atualizado_em` = '2025-06-15 12:48:49'
WHERE `pedidos`.`id` IN ('14')

    public function rastrear()
    {
        $pedidoModel = new PedidosTimeLineModel();
        $restauranteModel = new \App\Models\RestaurantesModel(); // Adicione este model

        $usuarioId = session()->get('usuario_id');
        if (!$usuarioId) {
            return redirect()->to('/login')->with('error', 'Você precisa estar logado');
        }

        // Busca pedidos com informações do restaurante
        $pedidos = $pedidoModel->select('pedidos.*, restaurantes.nome as restaurante_nome')
                    ->join('restaurantes', 'restaurantes.id = pedidos.restaurante_id')
                    ->where('pedidos.usuario_id', $usuarioId)
                    ->orderBy('pedidos.criado_em', 'DESC')
                    ->findAll();
---
SELECT `pedidos`.*, `restaurantes`.`nome` as `restaurante_nome`
FROM `pedidos`
JOIN `restaurantes` ON `restaurantes`.`id` = `pedidos`.`restaurante_id`
WHERE `pedidos`.`usuario_id` = '3'
ORDER BY `pedidos`.`criado_em` DESC

    public function detalhes($pedidoId)
    {
        $db = \Config\Database::connect();
        $pedidoModel = new \App\Models\PedidosTimeLineModel();

        // Busca o pedido
        $pedido = $pedidoModel->find($pedidoId);
---
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '14'